In [1]:
import numpy as np
import pandas as pd

In [2]:
# merge : bind / concat
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
    'B': ['B0', 'B1', 'B2'],
    'C': ['C0', 'C1', 'C2'],
    'D': ['D0', 'D1', 'D2']},
    index=[0, 1, 2])

df2 = pd.DataFrame({'A': ['A3', 'A4', 'A5'],
    'B': ['B3', 'B4', 'B5'],
    'C': ['C3', 'C4', 'C5'],
    'D': ['D3', 'D4', 'D5']},
    index=[3, 4, 5])

In [3]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2

In [4]:
df2

    A   B   C   D
3  A3  B3  C3  D3
4  A4  B4  C4  D4
5  A5  B5  C5  D5

In [9]:
df12a0 = pd.concat([df1,df2])

In [10]:
df12a0

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3
4  A4  B4  C4  D4
5  A5  B5  C5  D5

In [13]:
df3 = pd.DataFrame({'E': ['A6', 'A7', 'A8'],
    'F': ['B6', 'B7', 'B8'],
    'G': ['C6', 'C7', 'C8'],
    'H': ['D6', 'D7', 'D8']},
    index=[0, 1, 2])


df4 = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
     'B': ['B0', 'B1', 'B2'],
     'C': ['C0', 'C1', 'C2'],
     'E': ['E0', 'E1', 'E2']},
     index=[0, 1, 3])

In [16]:
df3

    E   F   G   H
0  A6  B6  C6  D6
1  A7  B7  C7  D7
2  A8  B8  C8  D8

In [17]:
df4

    A   B   C   E
0  A0  B0  C0  E0
1  A1  B1  C1  E1
3  A2  B2  C2  E2

In [15]:
pd.concat([df3,df4], axis=1) # 가로로 붙이겠다 : axis=1

     E    F    G    H    A    B    C    E
0   A6   B6   C6   D6   A0   B0   C0   E0
1   A7   B7   C7   D7   A1   B1   C1   E1
2   A8   B8   C8   D8  NaN  NaN  NaN  NaN
3  NaN  NaN  NaN  NaN   A2   B2   C2   E2

In [20]:
df14o = pd.concat([df1, df4]) # default join => outer

C:\Users\user\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

In [19]:
pd.concat([df1,df4], axis=1)

     A    B    C    D    A    B    C    E
0   A0   B0   C0   D0   A0   B0   C0   E0
1   A1   B1   C1   D1   A1   B1   C1   E1
2   A2   B2   C2   D2  NaN  NaN  NaN  NaN
3  NaN  NaN  NaN  NaN   A2   B2   C2   E2

In [22]:
df14i = pd.concat([df1, df4], join="inner")

In [23]:
df14i

    A   B   C
0  A0  B0  C0
1  A1  B1  C1
2  A2  B2  C2
0  A0  B0  C0
1  A1  B1  C1
3  A2  B2  C2

In [26]:
# join_axis를 써보자
df14i1 = pd.concat([df1,df4], axis=1, join='inner') # 가로로 붙이겠다 : axis=1

In [27]:
# join_axis를 써보자
df14io = pd.concat([df1,df4], axis=1, join='outer') # 가로로 붙이겠다 : axis=1
# outer가 default

In [28]:
pd.concat([df1,df4], axis=1, join_axes=[df1.index]) # 두개를 join했을 때, df1.index 리스트를 새로운 기준으로!

    A   B   C   D    A    B    C    E
0  A0  B0  C0  D0   A0   B0   C0   E0
1  A1  B1  C1  D1   A1   B1   C1   E1
2  A2  B2  C2  D2  NaN  NaN  NaN  NaN

In [31]:
pd.concat([df1,df4], axis=1, join_axes=[df4.index]) # 두개를 join했을 때, 특정

     A    B    C    D   A   B   C   E
0   A0   B0   C0   D0  A0  B0  C0  E0
1   A1   B1   C1   D1  A1  B1  C1  E1
3  NaN  NaN  NaN  NaN  A2  B2  C2  E2

In [34]:
type(df4.index)

pandas.core.indexes.numeric.Int64Index

In [35]:
df5 = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
     'B': ['B0', 'B1', 'B2'],
     'C': ['C0', 'C1', 'C2'],
     'D': ['D0', 'D1', 'D2']},
     index=['r0', 'r1', 'r2'])


df6 = pd.DataFrame({'A': ['A3', 'A4', 'A5'],
     'B': ['B3', 'B4', 'B5'],
     'C': ['C3', 'C4', 'C5'],
     'D': ['D3', 'D4', 'D5']},
     index=['r3', 'r4', 'r5'])

In [38]:
pd.concat([df5,df6]) # ignore_index = False : default

     A   B   C   D
r0  A0  B0  C0  D0
r1  A1  B1  C1  D1
r2  A2  B2  C2  D2
r3  A3  B3  C3  D3
r4  A4  B4  C4  D4
r5  A5  B5  C5  D5

In [40]:
pd.concat([df5,df6], ignore_index=True) # 원래 있던 idx 정보 날리고 0: 으로 초기화!

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3
4  A4  B4  C4  D4
5  A5  B5  C5  D5

In [42]:
# keys = 계층적 index를 구성 (중분류 / 대분류 / 소분류) : 그룹화 느낌!
# 계층 구조는 pivot table에서 많이 볼 수 있다
df56wk = pd.concat([df5,df6], keys=['df5','df6'])
df56wk

         A   B   C   D
df5 r0  A0  B0  C0  D0
    r1  A1  B1  C1  D1
    r2  A2  B2  C2  D2
df6 r3  A3  B3  C3  D3
    r4  A4  B4  C4  D4
    r5  A5  B5  C5  D5

In [45]:
df56wk.loc['df5'] # df56wk.ix['df5']

     A   B   C   D
r0  A0  B0  C0  D0
r1  A1  B1  C1  D1
r2  A2  B2  C2  D2

In [49]:
df56wk.loc['df5'][0:2] # 이런식으로도 슬라이싱 가능!
# df56wk.loc['df5'][0] 이건 에러나고
df56wk.loc['df5'][0:1] # 만든 사람이 슬라이싱을 '범위'로 주도록 만들었음

     A   B   C   D
r0  A0  B0  C0  D0

In [52]:
pd.concat([df5,df6],keys=['df5','df6'], names=['dfname','rownum']) 
# rowname들도 계층적으로도 줄 수 있다

                A   B   C   D
dfname rownum
df5    r0      A0  B0  C0  D0
       r1      A1  B1  C1  D1
       r2      A2  B2  C2  D2
df6    r3      A3  B3  C3  D3
       r4      A4  B4  C4  D4
       r5      A5  B5  C5  D5

In [53]:
df7 = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
     'B': ['B0', 'B1', 'B2'],
     'C': ['C0', 'C1', 'C2'],
     'D': ['D0', 'D1', 'D2']},
     index=['r0', 'r1', 'r2'])

df8 = pd.DataFrame({'A': ['A2', 'A3', 'A4'],
     'B': ['B2', 'B3', 'B4'],
     'C': ['C2', 'C3', 'C4'],
     'D': ['D2', 'D3', 'D4']},
     index=['r2', 'r3', 'r4'])

In [54]:
df7

     A   B   C   D
r0  A0  B0  C0  D0
r1  A1  B1  C1  D1
r2  A2  B2  C2  D2

In [55]:
df8

     A   B   C   D
r2  A2  B2  C2  D2
r3  A3  B3  C3  D3
r4  A4  B4  C4  D4

In [56]:
pd.concat([df7,df8])

     A   B   C   D
r0  A0  B0  C0  D0
r1  A1  B1  C1  D1
r2  A2  B2  C2  D2
r2  A2  B2  C2  D2
r3  A3  B3  C3  D3
r4  A4  B4  C4  D4

In [57]:
# veryfy_integrity
# 동일한 인덱스가 나오면 : 에러가 나오게 됨 : 동일한 인덱스를 넣으면 안되는 상황에서!
pd.concat([df7,df8], verify_integrity=True)

ValueError: Indexes have overlapping values: Index(['r2'], dtype='object')

In [58]:
# concat() / append() : 데이터프레임 + 시리즈 합치기 = 데이터프레임
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
    'B': ['B0', 'B1', 'B2'],
    'C': ['C0', 'C1', 'C2'],
    'D': ['D0', 'D1', 'D2']},
    index=[0, 1, 2])

In [59]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2

In [69]:
ser = pd.Series(['s1','s2','s3'], name='E') # 이름속성 붙이고 붙여주기

In [70]:
ser

0    s1
1    s2
2    s3
Name: E, dtype: object

In [72]:
pd.concat([df1,ser],axis=1, ignore_index=True)

    0   1   2   3   4
0  A0  B0  C0  D0  s1
1  A1  B1  C1  D1  s2
2  A2  B2  C2  D2  s3

In [258]:
s1 = pd.Series([0,1,2])
s2 = pd.Series([3,4,5])
s3 = pd.Series([11,12,33])

In [80]:
pd.concat([s1,s2,s3],axis=1,keys=['c1','c2','c3']) # 보통 row / col : row가 0 / col이 1

   c1  c2  c3
0   0   3  11
1   1   4  12
2   2   5  33

In [261]:
pd.concat([s1,s2,s3],axis=1,keys=['aa','bb','cc'])

   aa  bb  cc
0   0   3  11
1   1   4  12
2   2   5  33

In [82]:
# merge 함수
# how : 어떻게? : left / right / inner(default) / outer
# on(병합 기준 변수) : target column

dfleft = pd.DataFrame({'KEY': ['K0', 'K1', 'K2', 'K3'],
    'A': ['A0', 'A1', 'A2', 'A3'],
    'B': ['B0', 'B1', 'B2', 'B3']})


dfright = pd.DataFrame({'KEY': ['K2', 'K3', 'K4', 'K5'],
    'C': ['C2', 'C3', 'C4', 'C5'],
    'D': ['D2', 'D3', 'D4', 'D5']})

In [83]:
dfleft

  KEY   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [84]:
dfright

  KEY   C   D
0  K2  C2  D2
1  K3  C3  D3
2  K4  C4  D4
3  K5  C5  D5

In [99]:
dfmhr = pd.merge(dfleft,dfright,on='KEY',how='right')
dfmhr

  KEY    A    B   C   D
0  K2   A2   B2  C2  D2
1  K3   A3   B3  C3  D3
2  K4  NaN  NaN  C4  D4
3  K5  NaN  NaN  C5  D5

In [100]:
dfmhi = pd.merge(dfleft,dfright,on='KEY',how='inner') # inner join
dfmhi

  KEY   A   B   C   D
0  K2  A2  B2  C2  D2
1  K3  A3  B3  C3  D3

In [101]:
pd.merge(dfleft,dfright,on='KEY',how='outer')

  KEY    A    B    C    D
0  K0   A0   B0  NaN  NaN
1  K1   A1   B1  NaN  NaN
2  K2   A2   B2   C2   D2
3  K3   A3   B3   C3   D3
4  K4  NaN  NaN   C4   D4
5  K5  NaN  NaN   C5   D5

In [271]:
# index : row name 추가해주기
dfleft = pd.DataFrame({
    'A': ['A0', 'A1', 'A2', 'A3'],
    'B': ['B0', 'B1', 'B2', 'B3']},
    index = ['K0','K1','K2','K3'])


dfright = pd.DataFrame({
    'C': ['C2', 'C3', 'C4', 'C5'],
    'D': ['D2', 'D3', 'D4', 'D5']},
    index = ['K2', 'K3', 'K4', 'K5'])

In [272]:
dfleft

     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2
K3  A3  B3

In [273]:
dfright

     C   D
K2  C2  D2
K3  C3  D3
K4  C4  D4
K5  C5  D5

In [274]:
pd.merge(dfleft, dfright, left_index=True, right_index=True) 
# 이 때는 공통 인덱스(row)로 merge를 하겠다
# 왼쪽, 오른쪽의 프레임 모두다 존재하는 index에 대한 데이터 병합 수행하겠다

     A   B   C   D
K2  A2  B2  C2  D2
K3  A3  B3  C3  D3

In [275]:
pd.merge(dfleft, dfright, left_index=True, right_index=True)

     A   B   C   D
K2  A2  B2  C2  D2
K3  A3  B3  C3  D3

In [276]:
pd.merge(dfleft, dfright, left_index=True, right_index=True, how='left')

     A   B    C    D
K0  A0  B0  NaN  NaN
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2
K3  A3  B3   C3   D3

In [116]:
dfleft.join(dfright, how='left') # left join 이렇게 join함수로 할 수도 있음

     A   B    C    D
K0  A0  B0  NaN  NaN
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2
K3  A3  B3   C3   D3

In [122]:
pd.concat([dfleft,dfright], axis=1, join='inner') # 근데 merge가 좀더 디테일하게 할 수 있다

     A   B   C   D
K2  A2  B2  C2  D2
K3  A3  B3  C3  D3

In [137]:
# 결측치를 확인할 수 있는 함수 : isnull
dfleft = pd.DataFrame({'KEY': ['K0', 'K1', 'K2', 'K3'],
    'A': ['A0', 'A1', 'A2', 'A3'],
    'B': [1.1,2.2,3.3,4.4]})


dfright = pd.DataFrame({'KEY': ['K2', 'K3', 'K4', 'K5'],
    'C': ['C2', 'C3', 'C4', 'C5'],
    'D': ['D2', 'D3', 'D4', 'D5']})

In [126]:
pd.merge(dfleft,dfright,on='KEY',how='inner') # 이것이 default

  KEY   A   B   C   D
0  K2  A2  B2  C2  D2
1  K3  A3  B3  C3  D3

In [138]:
dfa = pd.merge(dfleft,dfright,on="KEY",how="outer")

# 결측값 관리

In [139]:
dfa

  KEY    A    B    C    D
0  K0   A0  1.1  NaN  NaN
1  K1   A1  2.2  NaN  NaN
2  K2   A2  3.3   C2   D2
3  K3   A3  4.4   C3   D3
4  K4  NaN  NaN   C4   D4
5  K5  NaN  NaN   C5   D5

In [140]:
# 자 결측값을 잡아보자

In [141]:
pd.isnull(dfa)
# dfa.isnull()

     KEY      A      B      C      D
0  False  False  False   True   True
1  False  False  False   True   True
2  False  False  False  False  False
3  False  False  False  False  False
4  False   True   True  False  False
5  False   True   True  False  False

In [142]:
pd.notnull(dfa)
dfa.notnull()

    KEY      A      B      C      D
0  True   True   True  False  False
1  True   True   True  False  False
2  True   True   True   True   True
3  True   True   True   True   True
4  True  False  False   True   True
5  True  False  False   True   True

In [143]:
dfa.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 6 entries, 0 to 5
Data columns (total 5 columns):
KEY    6 non-null object
A      4 non-null object
B      4 non-null float64
C      4 non-null object
D      4 non-null object
dtypes: float64(1), object(4)
memory usage: 288.0+ bytes

In [145]:
 # NaN값이 있어도 다른값들이 전부 float이면 이 column은 float column이다
dfa

  KEY    A    B    C    D
0  K0   A0  1.1  NaN  NaN
1  K1   A1  2.2  NaN  NaN
2  K2   A2  3.3   C2   D2
3  K3   A3  4.4   C3   D3
4  K4  NaN  NaN   C4   D4
5  K5  NaN  NaN   C5   D5

In [146]:
dfa.iloc[0]

KEY     K0
A       A0
B      1.1
C      NaN
D      NaN
Name: 0, dtype: object

In [152]:
dfa.iloc[0:2][['B','C']]

     B    C
0  1.1  NaN
1  2.2  NaN

In [153]:
dfa.ix[[0,1],['A','B']] = None

C:\Users\user\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

In [155]:
dfa # 뭐여 B컬럼에도 None 넗었는데 왜 없음? : 문자에는 None, 숫자에는 NaN으로 들어감!
# 문자열 "NaN"과 NaN이 구분이 안됨 : 예약어인 None씀

  KEY     A    B    C    D
0  K0  None  NaN  NaN  NaN
1  K1  None  NaN  NaN  NaN
2  K2    A2  3.3   C2   D2
3  K3    A3  4.4   C3   D3
4  K4   NaN  NaN   C4   D4
5  K5   NaN  NaN   C5   D5

In [156]:
dfa.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 6 entries, 0 to 5
Data columns (total 5 columns):
KEY    6 non-null object
A      2 non-null object
B      2 non-null float64
C      4 non-null object
D      4 non-null object
dtypes: float64(1), object(4)
memory usage: 448.0+ bytes

In [159]:
dfa.isnull() # NaN도, None도 null이다

     KEY      A      B      C      D
0  False   True   True   True   True
1  False   True   True   True   True
2  False  False  False  False  False
3  False  False  False  False  False
4  False   True   True  False  False
5  False   True   True  False  False

In [160]:
dfa.isnull().sum() # 중요 구문

KEY    0
A      4
B      4
C      2
D      2
dtype: int64

In [162]:
dfa.isnull().sum()['A']
# dfa['A'].isnull().sum() # 똑같다

4

In [163]:
dfa

  KEY     A    B    C    D
0  K0  None  NaN  NaN  NaN
1  K1  None  NaN  NaN  NaN
2  K2    A2  3.3   C2   D2
3  K3    A3  4.4   C3   D3
4  K4   NaN  NaN   C4   D4
5  K5   NaN  NaN   C5   D5

In [164]:
dfa.isnull().sum()

KEY    0
A      4
B      4
C      2
D      2
dtype: int64

In [166]:
dfa.isnull().sum(axis=1) # 이렇게 하면 row별 null 갯수

0    4
1    4
2    0
3    0
4    2
5    2
dtype: int64

In [167]:
dfa['NaN_Num'] = dfa.isnull().sum(axis=1)

In [168]:
dfa

  KEY     A    B    C    D  NaN_Num
0  K0  None  NaN  NaN  NaN        4
1  K1  None  NaN  NaN  NaN        4
2  K2    A2  3.3   C2   D2        0
3  K3    A3  4.4   C3   D3        0
4  K4   NaN  NaN   C4   D4        2
5  K5   NaN  NaN   C5   D5        2

In [169]:
dfa['Not_Num'] = dfa.notnull().sum(1)

In [170]:
dfa

  KEY     A    B    C    D  NaN_Num  Not_Num
0  K0  None  NaN  NaN  NaN        4        2
1  K1  None  NaN  NaN  NaN        4        2
2  K2    A2  3.3   C2   D2        0        6
3  K3    A3  4.4   C3   D3        0        6
4  K4   NaN  NaN   C4   D4        2        4
5  K5   NaN  NaN   C5   D5        2        4

In [172]:
dfa[dfa['NaN_Num']>=2] # 불리언 배열로 조건부 셀렉 가능

  KEY     A   B    C    D  NaN_Num  Not_Num
0  K0  None NaN  NaN  NaN        4        2
1  K1  None NaN  NaN  NaN        4        2
4  K4   NaN NaN   C4   D4        2        4
5  K5   NaN NaN   C5   D5        2        4

In [175]:
df = pd.DataFrame(np.arange(10).reshape(5,2),
                 columns=['c1','c2'],
                 index=['a','b','c','d','e'])

In [176]:
df

   c1  c2
a   0   1
b   2   3
c   4   5
d   6   7
e   8   9

In [177]:
# 연습문제 : b,c행 c1열에 None, b,e행 c2열 None 대입
tmp_df = df.copy()

In [178]:
tmp_df

   c1  c2
a   0   1
b   2   3
c   4   5
d   6   7
e   8   9

In [179]:
tmp_df.ix['b':'c','c1'] = None

C:\Users\user\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

In [188]:
tmp_df['c1'].sum()

14.0

In [190]:
tmp_df.ix[['b','e'],'c2'] = None

C:\Users\user\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

In [194]:
tmp_df['c2'].cumsum() # 누적합

a     1.0
b     NaN
c     6.0
d    13.0
e     NaN
Name: c2, dtype: float64

In [196]:
tmp_df.mean() # NaN은 분석 대상에서 제외됨 # axis=0(default)

c1    4.666667
c2    4.333333
dtype: float64

In [199]:
tmp_df.std() # NaN은 분석 대상에서 제외됨

c1    4.163332
c2    3.055050
dtype: float64

In [181]:
tmp_df

    c1   c2
a  0.0  1.0
b  NaN  NaN
c  NaN  5.0
d  6.0  7.0
e  8.0  NaN

In [183]:
df.loc['a':'c']['c2'] = 333

C:\Users\user\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """Entry point for launching an IPython kernel.

In [184]:
df

   c1  c2
a   0   1
b   2   3
c   4   5
d   6   7
e   8   9

In [185]:
df.loc['a':'c']['c2']

a    1
b    3
c    5
Name: c2, dtype: int32

In [186]:
df.sum()

c1    20
c2    25
dtype: int64

In [187]:
tmp_df.sum()

c1    14.0
c2    13.0
dtype: float64

In [200]:
tmp_df

    c1   c2
a  0.0  1.0
b  NaN  NaN
c  NaN  5.0
d  6.0  7.0
e  8.0  NaN

In [203]:
tmp_df['c3'] = tmp_df['c1'] + tmp_df['c2']
# DF에서 테이블간 연산시, 어느 하나라도 NaN이 존재하면 결과도 NaN이 됨

In [204]:
tmp_df

    c1   c2    c3
a  0.0  1.0   1.0
b  NaN  NaN   NaN
c  NaN  5.0   NaN
d  6.0  7.0  13.0
e  8.0  NaN   NaN

# 결측치 대체

In [206]:
df = pd.DataFrame(np.random.randn(5,3),
            columns=['c1','c2','c3'])

In [207]:
df

         c1        c2        c3
0  0.752617 -0.484488 -0.398478
1  0.407309  0.913798  0.651297
2 -1.613292  1.228595 -1.350835
3  0.054922 -0.596326 -0.877100
4 -1.016624  0.162243 -0.471112

In [218]:
df.ix[0,0] = None # colname이 있어도 default Num 사용할 수 있음

C:\Users\user\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

In [220]:
df # NaN이 잘 들어갔네

         c1        c2        c3
0       NaN -0.484488 -0.398478
1  0.407309  0.913798  0.651297
2 -1.613292  1.228595 -1.350835
3  0.054922 -0.596326 -0.877100
4 -1.016624  0.162243 -0.471112

In [225]:
df.ix[1,[0,2]] = np.nan # 여러개 같이 하려면 list로 묶어서

C:\Users\user\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

In [226]:
df

         c1        c2        c3
0       NaN -0.484488 -0.398478
1       NaN  0.913798       NaN
2 -1.613292  1.228595 -1.350835
3  0.054922 -0.596326 -0.877100
4 -1.016624  0.162243 -0.471112

In [227]:
df.ix[1,'c2'] = np.nan
df.ix[2,'c2'] = np.nan
df.ix[3,'c2'] = np.nan
df.ix[4,'c3'] = np.nan
df

C:\Users\user\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.
C:\Users\user\Anaconda3\lib\site-packages\ipykernel_launcher.py:2: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated

C:\Users\user\Anaconda3\lib\site-packages\ipykernel_launcher.py:3: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  This is separate from the ipykernel package so we can avoid doing imports until
C:\Users\user\Anaconda3\lib\site-packages\ipykernel_launcher.py:4: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  after removing the cwd from sys.path.

         c1        c2        c3
0       NaN -0.484488 -0.398478
1       NaN       NaN       NaN
2 -1.613292       NaN -1.350835
3  0.054922       NaN -0.877100
4 -1.016624  0.162243       NaN

In [228]:
# 이제 NaN값 바꾸기
df.fillna(100) # 원 DF에는 영향 미치지 않음

           c1          c2          c3
0  100.000000   -0.484488   -0.398478
1  100.000000  100.000000  100.000000
2   -1.613292  100.000000   -1.350835
3    0.054922  100.000000   -0.877100
4   -1.016624    0.162243  100.000000

In [230]:
df.fillna('missing')

          c1        c2        c3
0    missing -0.484488 -0.398478
1    missing   missing   missing
2   -1.61329   missing  -1.35083
3  0.0549215   missing   -0.8771
4   -1.01662  0.162243   missing

In [231]:
# 채워넣는 것에도 방법이 있다!
df.fillna(method='ffill')

         c1        c2        c3
0       NaN -0.484488 -0.398478
1       NaN -0.484488 -0.398478
2 -1.613292 -0.484488 -1.350835
3  0.054922 -0.484488 -0.877100
4 -1.016624  0.162243 -0.877100

In [232]:
df.fillna(method='ffill',limit=1) # 바뀌는 개수 제한

         c1        c2        c3
0       NaN -0.484488 -0.398478
1       NaN -0.484488 -0.398478
2 -1.613292       NaN -1.350835
3  0.054922       NaN -0.877100
4 -1.016624  0.162243 -0.877100

In [233]:
df.mean()

c1   -0.858332
c2   -0.161123
c3   -0.875471
dtype: float64

In [236]:
df.fillna(df.mean()) # 열 단위로 구해진 평균으로 채워짐

         c1        c2        c3
0 -0.858332 -0.484488 -0.398478
1 -0.858332 -0.161123 -0.875471
2 -1.613292 -0.161123 -1.350835
3  0.054922 -0.161123 -0.877100
4 -1.016624  0.162243 -0.875471

In [240]:
df.fillna(df.mean()['c1']) # c1열의 평균으로 다 채워버리기

         c1        c2        c3
0 -0.858332 -0.484488 -0.398478
1 -0.858332 -0.858332 -0.858332
2 -1.613292 -0.858332 -1.350835
3  0.054922 -0.858332 -0.877100
4 -1.016624  0.162243 -0.858332

In [241]:
df.mean(1)

0   -0.441483
1         NaN
2   -1.482063
3   -0.411089
4   -0.427191
dtype: float64

In [243]:
# numpy의 where함수 사용해보자
df2 = pd.DataFrame({"a1":[1,2,3,4,5],
                   "a2":[10,11,12,13,14]})
df2.ix[[1,3],['a2']] = np.nan

C:\Users\user\Anaconda3\lib\site-packages\ipykernel_launcher.py:4: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  after removing the cwd from sys.path.

In [244]:
df2

   a1    a2
0   1  10.0
1   2   NaN
2   3  12.0
3   4   NaN
4   5  14.0

In [247]:
tmp_df2 = np.where(df2.isnull(), None, df2)

In [248]:
tmp_df2

array([[1.0, 10.0],
       [2.0, None],
       [3.0, 12.0],
       [4.0, None],
       [5.0, 14.0]], dtype=object)

In [249]:
type(tmp_df2) # 근데 요렇게 하면 numpy 배열 객체로 돌아온다 : DF가 아님..

numpy.ndarray

In [253]:
# a3열 추가 : a2열이 NAN이면 a1값 -> a3
# 아니면 a2값 -> a3
# 이게 이렇게 numpy값을 그냥 바로 때려넣을 수 있네...?
df2['a3'] = np.where(pd.notnull(df2['a2']),df2['a2'],df2['a1'])

In [254]:
df2

   a1    a2    a3
0   1  10.0  10.0
1   2   NaN   2.0
2   3  12.0  12.0
3   4   NaN   4.0
4   5  14.0  14.0

In [256]:
df2['a3'] = np.where(df2['a2'].isnull(), df2['a1'], df2['a2']) # 위식이랑 똑같은 거

In [257]:
df2

   a1    a2    a3
0   1  10.0  10.0
1   2   NaN   2.0
2   3  12.0  12.0
3   4   NaN   4.0
4   5  14.0  14.0